In [2]:
import pandas as pd

In [3]:
employees = pd.DataFrame({
    "EmpID": [1, 2, 3],
    "Name": ["Alice", "Bob", "Charlie"],
    "DeptID": [10, 20, 30]
})
 
departments = pd.DataFrame({
    "DeptID": [10, 20, 40],
    "DeptName": ["HR", "Engineering", "Marketing"]
})

In [4]:
pd.merge(employees, departments, on='DeptID') #inner join

   EmpID   Name  DeptID     DeptName
0      1  Alice      10           HR
1      2    Bob      20  Engineering

In [6]:
pd.merge(employees, departments, on='DeptID', how='left') #left join

   EmpID     Name  DeptID     DeptName
0      1    Alice      10           HR
1      2      Bob      20  Engineering
2      3  Charlie      30          NaN

In [7]:
pd.merge(employees, departments, on='DeptID', how='right') #right join

   EmpID   Name  DeptID     DeptName
0    1.0  Alice      10           HR
1    2.0    Bob      20  Engineering
2    NaN    NaN      40    Marketing

In [8]:
df1 = pd.DataFrame({"Name": ["Alice", "Bob"]})
df2 = pd.DataFrame({"Name": ["Charlie", "David"]})

In [9]:
df1

    Name
0  Alice
1    Bob

In [10]:
df2

      Name
0  Charlie
1    David

In [11]:
pd.concat([df1, df2])

      Name
0    Alice
1      Bob
0  Charlie
1    David

In [12]:
pd.concat([df1, df2],axis=1)

    Name     Name
0  Alice  Charlie
1    Bob    David

In [13]:
df1 = pd.DataFrame({"Name": ["Alice", "Bob"],"score":["10","20"]})
df2 = pd.DataFrame({"Name": ["Charlie", "David"]})

In [14]:
df1

    Name score
0  Alice    10
1    Bob    20

In [16]:
pd.concat([df1, df2])

      Name score
0    Alice    10
1      Bob    20
0  Charlie   NaN
1    David   NaN